{"artist": "Mac Miller", "album": "Balloonerism","album_recorded_year": 2014,"album_release_year": 2025, "track_title": "DJ's Chord Organ (feat. SZA)", "genius_url": "https://genius.com/Mac-miller-djs-chord-organ-lyrics", "lyrics": "61 Contributors\nTranslations\nУкраїнська\nFrançais\nEspañol\nDJ’s Chord Organ Lyrics\n“DJ’s Chord Organ” was made using the chord organ of lo-fi pioneer Daniel Johnston. Mac acquired the organ in November 2013 after becoming an executive producer of Johnston’s biographical film Hi, How Are You… \nRead More\n \n[Intro: Mac Miller & \nJosh Berg\n]\nWhat he said after the Grammys\nB-flat\nF\nB-flat\nF\nD\n(Ooh)\n[Chorus: SZA & Thundercat]\nWatch the world go 'round, and 'round, and 'round, and 'round\nWatch the world go 'round, and 'round, and 'round, and 'round\nWatch the world go 'round, and 'round, and 'round, and 'round\nWatch the world go 'round, and 'round, and 'round, and 'round\nWatch the world go 'round, and 'round, and 'round, and 'round\nWatch the world go 'round, and 'round, and 'round, and 'round\nWatch the world go 'round, and 'round, and 'round, and 'round\nWatch the world go 'round, and 'round, and 'round, and 'round\n[Verse: SZA]\nI love when you smell like your car\nSmell like you've been drivin' for days\nYou ain't even stop for gas, my nigga\nMr. Postman\nIs you drivin' to me?\nIs you drivin' cross-country?\nYou've been up for three days with one nap\nI know you miss the nighttime\nI know you miss your lifetime\nTell me the truth about it\nTell me the truth about it\nTell us the truth about it\nCocaine is ruthless\nI know the truth about it\nCocaine is ruthless"}
{"artist": "Mac Miller", "album": "Balloonerism","album_recorded_year": 2014,"album_release_year": 2025, "track_title": "Do You Have A Destination?", "genius_url": "https://genius.com/Mac-miller-do-you-have-a-destination-lyrics", "lyrics": "44 Contributors\nTranslations\nFrançais\nEspañol\nDo You Have a Destination? Lyrics\n[Intro: Mac Miller]\nAlright, let's get started\nWoo (Yeah), you can feel it (Yuh)\nCan you feel it? Vibrations (Yeah)\n[Verse 1: Mac Miller]\nOkay, I went to sleep faded, then I woke up invisible\n (Wow)\nKeep the ingredients, but I got the kitchen full (Woah)\nMy thoughts is cynical, actions unpredictable\nSupermodel bitches hold auditions in my swimmin' pool (Woo)\nThis feelin' is feelin' pretty invincible (I know)\nPray this life reciprocal, and I'ma come back an eagle\nThirsty for evil, the wine chilled in hell (Right here)\nI gave my life to this shit, already killed myself (Woo)\n(No, no, no, no, no) We ain't the same, homie (No)\nThe world afraid to change, but it changed on me (Woah)\nAlways been the realest, keep the same homies (Uh-huh)\nSo all that bullshit fades slowly\n[Chorus: Mac Miller]\nIt's goin' (Goin'), goin' (Goin'), goin' (Goin'; Okay), goin' (Goin'; Ooh)\nGoin' (Goin'), goin' (Goin'), goin' (Goin'), goin' (Goin')\nWill you follow? (Ooh)\nWhere are you going? (Watch it go, woah-woah-woah, woah-woah-woah)\nWhere are you going? (Woah-woah-woah, woah-woah-woah)\nWhere are you going? (Woah-woah-woah, woah-woah-woah)\nWhere the fuck are you going? (Woah, woah)\nOkay (Woah-woah-woah, wow)\nGoin' (Goin', goin', woah-woah-woah, yeah, wow)"}
{"artist": "Mac Miller", "album": "Balloonerism","album_recorded_year": 2014,"album_release_year": 2025, "track_title": "5 Dollar Pony Rides", "genius_url": "https://genius.com/Mac-miller-5-dollar-pony-rides-lyrics", "lyrics": "51 Contributors\nTranslations\nFrançais\nEspañol\nItaliano\nPortuguês\n5 Dollar Pony Rides Lyrics\n“5 Dollar Pony Rides”, the lead single from Balloonerism, sees Mac Miller reflecting on a complex, emotionally distant relationship. The song blends nostalgia with empathy, as Mac offers both temporary… \nRead More\n \n[Verse 1]\nSaid, it ain't about money\nI could show you the world, girl\nWhat can you do for me?\nWe can take a vacation, go somewhere in the country\nTurn the radio on, hear my song sayin' (Woah, oh, oh)\nMy favorite song sayin' (Woah, oh, oh)\nShe don't know she slept through the future\nMissed it, it was yesterday\nSo we (We) right (Right) back where we started\nShe still tryna get away (Get away)\nGirl, you wastin' my time (Time)\nAnd I am wastin' your time\nBut that's okay (Woah, oh, oh)\nI said, it's okay (Woah, oh, oh, oh)\n[Chorus]\nLet me give you what you want (Need), ooh\nAnd maybe later, what you need (Need), yeah\nI remember, girl, you used to have fun (Need), yeah\nNow I ain't seen a smile in a while\nHeard you're feelin' pretty lonely (Need), yeah\nYour daddy shoulda got you that pony\nLet me give you what you want\n[Verse 2]\nKillin' yourself like this\nGoin' crazy, keepin' all of these secrets\nHow is that livin'? (Livin', livin')\nEvery time I reminisce, I keep thinkin' it was better then\nI remember when we made (Made) out (Out) underneath the rain clouds\nStay (Stay) out (Out) late, I wanna lay down\nBreak (Break) ground (Ground), then you tell me (Woah, oh, oh)\nWoah, oh, woah, oh (Woah, oh)\nWe could be okay, don't know for sure (She don't, she don't, she don't know)\nJust familiar numbers hammered to your door\nYou left home right away (Right away)\n'Cause your life is like night and day (Night and day)\nYou keep goin', goin', goin' back and forth"}
{"artist": "Mac Miller", "album": "Balloonerism","album_recorded_year": 2014,"album_release_year": 2025, "track_title": "Friendly Hallucinations", "genius_url": "https://genius.com/Mac-miller-friendly-hallucinations-lyrics", "lyrics": "40 Contributors\nTranslations\nEspañol\nFrançais\nFriendly Hallucinations Lyrics\nOn “Friendly Hallucinations”, Mac explores the relationship between drugs and the false sense of comfort that they may bring, as well as the detachment from the world and raw human emotions it may evoke.\n[Verse 1: Mac Miller]\nCan you hear the whispers of an innocent, ignorant child? (Child)\nIn the ocean, get to swimmin' or drown (Drown)\nHow long has it been since you smiled? (Smiled)\nGirl, I love the way your body fit inside that gown (That gown)\nHer Mama was a lady bug\n, her Papa was an atheist\nWorkin' on a novel set in Cold War Romania ('Mania)\nChasin' love, idolizin' \nJoan of Arcadia\nPray the landscapers don't wake her up (Her up)\nI'm a slave to the bass line\nConversation topic got us tangled in the grape vine\nStill wide awake, I'm a stranger to the daytime\nVampire, higher than a hang glider\nLook around and all I see is gray skies (Gray skies)\nThere's help inside that medicine cabinet\nCame in for the answers, but she left with a habit\nThere's no one on the other end of that telephone ('Phone)\nLet's fall asleep to the metronome (The metronome), yeah\n[Chorus: Mac Miller, \nMac Miller & SZA\n]\nShe's fallin' for her hallucinations (Hallucinations)\nBut what's love without imagination? Yeah\nBaby, don't let them tell you what's real and what's not (And what's not)\nThere's a paradise waiting on the other side of the dock, woah\nIt's only real if it's real to you\n (Does it feel?)\nIt's only real if it's real to you\nIt's only real if it's real to you\n (So, what's it feel like? Yeah)"}
{"artist": "Mac Miller", "album": "Balloonerism","album_recorded_year": 2014,"album_release_year": 2025, "track_title": "Mrs. Deborah Downer", "genius_url": "https://genius.com/Mac-miller-mrs-deborah-downer-lyrics", "lyrics": "37 Contributors\nTranslations\nFrançais\nEspañol\nMrs. Deborah Downer Lyrics\n[Verse 1: Mac Miller]\nYeah, nothin' is impossible (Impossible)\nDo this shit together, we unstoppable (Unstoppable)\nRaised to be a leader, not a navigator (Navigator)\nWrote this down on scraps of paper\nAll roads lead to the same confusion (Same confusion)\nI mean, all roads lead to the same conclusions (Same conclusions)\nFound my body somewhere in the sewer (Sewer)\nMy girl defined the word \"prolific\" for me\nAnd I can't read her mind, she wrote a different story (A different story)\nOh well, redemption is a funny bitch (Funny bitch)\nThe devil always be right where the money is (The money is)\nSomebody gotta be watchin' you, but no one is (But no one is)\nIt's kinda crazy life could be this simple (Life could be this simple)\nNothing's coincidence\nMy best friend packed his things, threw 'em in the car\nI haven't seen him since (Seen him since)\nGuess I understand, he always got the chills\nWhen he saw a room full of rolled up hundred dollar bills (Hundred dollar bills), yeah\n[Refrain: Mac Miller]\nEven pills turn to powder, baby\nSaid, even pills turn to powder\nThe world wanna crush 'em down (Crush 'em down)\nEven pills turn to powder, baby\nCan you sit right next to me and crush 'em down? (Crush 'em down)\nIf pills can turn to powder\nThen this world could turn to ash\nEverything seems so slow\nBut my past, I thought that it would last longer\nI just thought that, thought that, thought that\nThis feelin', this feelin' would last longer, yeah"}
{"artist": "Mac Miller", "album": "Balloonerism","album_recorded_year": 2014,"album_release_year": 2025, "track_title": "Stoned", "genius_url": "https://genius.com/Mac-miller-stoned-lyrics", "lyrics": "50 Contributors\nTranslations\nEspañol\nFrançais\nStoned Lyrics\n[Intro]\nYeah, yeah\nBreaks down the pain\nYeah\n[Verse 1]\nShe breaks down the pain, she rolls up the weed\nShe far from a saint, she's all that I need\nShe lost in her thoughts, so hardly she speaks\nHer mind's always dirty and her soul's never free (Woah-woah)\nShe never been a groupie (No way)\nShe just in love with the music\nShe watch depressin' movies (Always)\nSomethin' from the '30s or the '40s about a dependent house wife (Woah-woah)\nShe makes up her bed like she makes up her stories\nAwake through the night, then she high from the morning\nI wish she could feel me, she never felt nothin'\nKnock on her door, she let me come in (Woah)\n[Pre-Chorus]\nI wish she would learn to laugh\nIsolation, she lockin' the bathroom door\n[Chorus]\nBaby, let's get stoned\nPut on a record, can I play you one more song?\nWe can get stoned\nI swear to God, Heaven feels just like home\nLet's go home (Yeah)"}
{"artist": "Mac Miller", "album": "Balloonerism","album_recorded_year": 2014,"album_release_year": 2025, "track_title": "Shangri-La", "genius_url": "https://genius.com/Mac-miller-shangri-la-lyrics", "lyrics": "29 Contributors\nTranslations\nFrançais\nEspañol\nShangri-La Lyrics\n[Intro]\nDon't be afraid to put your two cents in\nMight not be able to afford anything, but\nI'm always up for a bargain\nThe dragons are flying south for the winter\nThey don't like cold weather either\n[Verse 1]\nOkay, I was drivin' up to Shangri-La to get my meditation on\nI was thinkin' Lamb of God, she was thinkin' Saint Laurent\nShe sell the pussy on Millionaire's Avenue\nPaper's not the problem, spendin' money always casual\nWhy do you whine like your last name was Rothschild?\nLife been a bitch ever since they let me out the doghouse\nNo mercy for the docile, flow is hostile but don't sleep\nThe codeine came back to get me high again\n[Pre-Chorus]\nJust how super is a supermodel? (\nOh\n)\nJust how super is a supermodel? (\nOh\n)\n[Chorus]\nIt's the house of the risin' sun, a village of unusual\nIf I'm dyin' young, promise you'll smile at my funeral\nYeah, it's just a rule to follow\nLive today 'cause you can lose tomorrow"}
{"artist": "Mac Miller", "album": "Balloonerism","album_recorded_year": 2014,"album_release_year": 2025, "track_title": "Funny Papers", "genius_url": "https://genius.com/Mac-miller-funny-papers-lyrics", "lyrics": "72 Contributors\nTranslations\nFrançais\nEspañol\nFunny Papers Lyrics\nOn “Funny Papers”, Mac takes the negative and positive of what one might read in a newspaper—sometimes called “funny papers\"—while reflecting similarly on his own emotions. The term \"funny papers” gives a… \nRead More\n \n[Intro]\nDid no one ever teach you how to dance?\nNobody ever taught you how to dance?\nWell—well, everyone knows how to dance\nThere's only so much time\n[Verse 1]\nYeah, somebody died today, I\nI saw his picture in the funny papers\nDidn't think anybody died on a Friday\nSome angry banker, some kind of money trader\nRecently divorced, was drunk drivin' down the highway\nAnd drove off the bridge to his wedding song\nBlew out the bass in his speakers, you can still hear the treble goin' (Treble goin')\nThe hospital was useless, and everything was quiet but the music\nRecently, I only meet peace when in deep sleep\nBeen the same dream, world safe, smile on her face\nWaitin' on the other side (The other side)\nI wonder if He'll take me to the other side (The other side), yeah\nWhat your eyes see, too naive for war, and that'll screw ya\nStill bet it all on the glory, hallelujah\nI heard the answer in the gibberish of an old drunk\nAll he said was he's in no rush\n[Chorus]\nIf I could just pay my rent by Tuesday\nI bet I'd be rich by April Fools' day\nThe moon's wide awake, with a smile on his face\nAs he smuggle constellations in his suitcase\nDon't you love silence? (Silence)"}
{"artist": "Mac Miller", "album": "Balloonerism","album_recorded_year": 2014,"album_release_year": 2025, "track_title": "Excelsior", "genius_url": "https://genius.com/Mac-miller-excelsior-lyrics", "lyrics": "27 Contributors\nTranslations\nFrançais\nEspañol\nExcelsior Lyrics\nOn “Excelsior” (Latin for “higher”), Mac reminisces on the responsibility-free days of being a kid, before modern-day issues inherent to adulthood completely erode that childlike sense of playfulness… \nRead More\n \n[Intro: Mac Miller]\nYeah, yah\nYeah, yeah, yeah, yeah\nYeah (Yeah), um\n[Verse: Mac Miller & \nDelusional Thomas\n]\nOn Fourth Street, the orphan children play on the jungle gym\nLittle Timmy broke his arm again on the monkey bars\nJohnny's dad got a nicer car than all the other kids\nHe becomes the alpha and picks on everybody else\nMax protects Claire from all the bullies\nClaire always wish she was as pretty as Julie\nThe boys always chase Julie around the sandbox\nClaire just waits ’til she gets picked up by her grandpa\nAll of this before the brainwash starts\nBefore they get polluted, start thinkin' like adults\nLife is fantasy and somersaults then\nBefore the world tear apart imagination\nBefore there were rules, before there were limits\nYour only enemies were (Br-Brussels sprouts and spinach)\nMe, I used to want to be a wizard, when did life get so serious?\nWhatever happened to apple juice and cartwheels?\nWhatever happened to apple juice and cartwheels?\n[Outro: Mac Miller]\nAbracadabra\nAbracadabra\nAbra-cadabra (Hahaha)\nAbracadabra!\nVadacadous!\nExcelsior!"}
{"artist": "Mac Miller", "album": "Balloonerism","album_recorded_year": 2014,"album_release_year": 2025, "track_title": "Transformations (feat. Delusional Thomas)", "genius_url": "https://genius.com/Mac-miller-transformations-lyrics", "lyrics": "40 Contributors\nTranslations\nFrançais\nEspañol\nTransformations Lyrics\nIn “Transformations”, we get a live listen into the mind of Mac Miller in his legendary “Sanctuary” era, for which Mac was known to have not only honed his production skills as Larry Fisherman, but opened the… \nRead More\n \n[Intro: Mac Miller]\nJust kidding\nEverything ready, man? Features, man\nThis is gonna be fuckin' crazy, bro\nThis one's gonna be great, bro\nWe're gonna go off crazy, bro\nThis feature's for the hip-hop world, like, so we gotta take this one seriously, bro\nIt's really just Alarm Clock's\nAlright, he told me he wanted, he need to do a feature on the low, so I gotta do it right\nAnd when you're dealin' with DJ Clockwork\nYou're dealin' with someone that, A. knows his hip-hop\nHe knows his hip-hop, he, you know, he's a student of the game\nAnd, and, and he treats his bars like a, you know, he really does that shit\nUm\nI'm straight\nHere, at least have a, a beverage\nOh, there's a beer up there, there's a beer in the fridge, there's a, uh\nGrab the Tecate and then the Pacifico\n'Cause one's a bottle, and one's a can\nI don't know how, how much I'm tryna go in\nThank you, bro\n[Interlude: Delusional Thomas]\nYeah, um, alright\nOkay, so"}
{"artist": "Mac Miller", "album": "Balloonerism","album_recorded_year": 2014,"album_release_year": 2025, "track_title": "Manakins", "genius_url": "https://genius.com/Mac-miller-manakins-lyrics", "lyrics": "30 Contributors\nTranslations\nFrançais\nEspañol\nManakins Lyrics\n[Intro: Mac Miller]\nYeah\n[Verse 1: Mac Miller]\nWell, my good days are exactly like the bad ones\nMy bitch say that I defy the laws of attraction\nI've always been terrified of endin' up normal (Normal)\nThings that we all search for end up findin' us\nGod is like the school bell, He gon' tell you when your time is up\nShit just end up workin' out, why do we wonder why it does? (Why it does)\nYeah, so I asked God to take me on a perfect day\nSwear I saw Him cryin', don't know why everyone sure it's rain\nEducation system, but I feel we only learn from change\nEvery time I think about it, shit just starts to hurt my brain\nProblems we can't solve always seem to be my favorite ones\nLife just gets so boring, playing superhero makes it fun (Fun)\nBut why is \"heroism\" so close to \"heroin\"? (Heroin)\n[Chorus: Dylan Reynolds & \nMac Miller\n]\nWe are what we believe in\nThere is no such thing as freedom\nBut what can we do?\nWhat can we do?\n'Cause I see the light at the end of the tunnel (\nYeah\n)\nIt feels like I'm dyin', dyin' (\nYeah\n), dyin'\nI'm dead"}
{"artist": "Mac Miller", "album": "Balloonerism","album_recorded_year": 2014,"album_release_year": 2025, "track_title": "Rick's Piano", "genius_url": "https://genius.com/Mac-miller-ricks-piano-lyrics", "lyrics": "41 Contributors\nTranslations\nFrançais\nEspañol\nRick’s Piano Lyrics\nJosh Berg, Mac’s engineer who recorded the entirety of Balloonerism and can be heard in the song’s intro, spoke on Reddit about the creation of “Rick’s Piano”:\n\nMac recorded himself on his phone at [Rick… \nRead More\n \n[Intro: Mac Miller & \nJosh Berg\n]\nUh, Josh (\nYes?\n)\nKnock, knock (\nWho's there?\n)\nRick Rubin (\nRick Rubin who?\n)\nRick Rubin's piano (\nAyy\n), alright (\nYes\n)\nEnough fuckin' around (\nOkay\n)\nYeah\nYeah (Yeah, yeah), wake up (Wake up)\nOpen up your eyes, I told you wake up (Wake up)\nAll of y'all are still bitches, but\nA smile just in place of your make up (Your make up)\nThe best is yet to come (Yeah)\n(What?) Yeah (What?)\n[Verse 1: Mac Miller]\nE.T.'s not dead, he's just a little bit faded\nPlease don't give me any credit, that's how people get jaded\nPlease don't nod your hеad, and please don't tell mе I made it\n'Cause people start to get worse once they think they the greatest (The greatest; Be patient)\n[Refrain: Mac Miller, \nMac Miller & Dylan Reynolds\n]\nThe best is yet to come (\nThe best is yet to come\n), yeah (Yeah)\n[Verse 2: Mac Miller]\nI told her, \"It get better soon\"\nI probably shoulda told her when she was in a better mood\nShe lookin' at me like, \"Anyone, except for you\"\nI had to go to California, she wished that I never moved"}
{"artist": "Mac Miller", "album": "Balloonerism","album_recorded_year": 2014,"album_release_year": 2025, "track_title": "Tomorrow Will Never Know", "genius_url": "https://genius.com/Mac-miller-tomorrow-will-never-know-lyrics", "lyrics": "71 Contributors\nTranslations\nEspañol\nFrançais\nTomorrow Will Never Know Lyrics\n“Tomorrow Will Never Know” is a hauntingly abstract and psychedelic song. Its foreboding tone is further driven by the recurring motif of a ringtone and automated voicemail playing in the background, from… \nRead More\n \n[Verse 1]\nDo you fear that you'll have no control? \n(\nYour call has been forwarded to an automated—\n)\nYou walk through this world with your head above water\nShoes made of copper, just tryin' to float\nThe lake's frozen over, look down at yourself\nWhat's starin' back doesn't please you\nThe man don't believe you, he sees through the lies that you tell\nCards in your hand, you're lookin' at nothin'\nYou wonder when God will just listen and give you a break\nAnd He says, \"See, living and dying are one and the same\"\n[Chorus]\nDo they dream just like we do?\nDo they dream just like we do?\nDo they love just like we do? (Oh)\nDo they love just like we do? (Oh-oh-oh, oh-oh-oh)\nDo they feel just like we do? (Oh)\nDo they feel just like we do? (Oh-oh-oh-oh, oh-oh-oh-oh, oh-oh-oh-oh)\n[Verse 2]\nDo you know anything at all?\nYou've been waiting for answers\nThese parades and dancers keep building your castles from straw\nThe moon made of water, you swim to the shore\nYou can try your best escaping, the universe is breaking\nYou say you can't take it no more\nThe pressure is building like buildings you jumped from\nWishing that wishing could lift this conundrum\nThe streets that you walk on are shallow\nBut do you feel as big as your shadow?"}
