{"artist": "Mac Miller", "album": "Circles","album_recorded_year": 2018,"album_release_year": 2020, "track_title": "Circles", "genius_url": "https://genius.com/Mac-miller-circles-lyrics", "lyrics": "81 Contributors\nTranslations\nSvenska\nEspañol\nРусский (Russian)\nItaliano\nCircles Lyrics\n“Circles” is the first track from Mac Miller’s posthumous album of the same name. On January 8, 2020, Mac’s official Twitter account’s bio changed to “Circles. January 17th.” His official Instagram account… \nRead More\n \n[Verse 1]\nWell, this is what it look like right before you fall\nStumblin' around, you've been guessin' your direction\nNext step, you can't see at all\nAnd I don't have a name, I don't have a name, no\nWho am I to blame? Who am I to blame though?\nAnd I cannot be changed, I cannot be changed, no\nTrust me, I've tried\nI just end up right at the start of the line\nDrawin' circles\nMmm\n[Verse 2]\nWell, I drink my whiskey and you sip your wine\nWe're doing well, sittin', watchin' the world fallin' down, its decline\nAnd I can keep you safe, I can keep you safe, mmm\nDo not be afraid, do not be afraid\nYou're feelin' sorry, I'm feelin' fine\nDon't you put any more stress on yourself, it's one day at a time\nIt's gettin' pretty late, gettin' pretty late\nDamn, and I find\nIt goes around like the hands that keep countin' the time\nDrawin' circles"}
{"artist": "Mac Miller", "album": "Circles","album_recorded_year": 2018,"album_release_year": 2020, "track_title": "Complicated", "genius_url": "https://genius.com/Mac-miller-complicated-lyrics", "lyrics": "59 Contributors\nTranslations\nSvenska\nEspañol\nРусский (Russian)\nPolski\nItaliano\nComplicated Lyrics\nOn “Complicated,” Mac stresses over life’s daily, never-ending complications. Over a soulful melody orientated by multiple synths, Mac emphasizes that he’s “too young” to be feeling the way he does, and… \nRead More\n \n[Verse 1]\nOutside is cloudy, but I like that better (Better, better)\nBehind the wheel, but still ain't on my way\nSome people say they want to live forever\nThat's way too long, I'll just get through today\n[Chorus]\nWithout any complications (Ooh, ooh, ooh, ooh)\nDoes it always gotta, does it always gotta\nGotta be so complicated? (Ooh, ooh, ooh, ooh)\nWell, I'm way too young to be gettin' old\n[Verse 2]\nAnd all I wanna do is look, but I can't see, baby\nWho you talkin' to while you talkin' to me, baby?\nLet me, let me know if I can see you later\nWe could make it easy\n[Verse 3]\nInside my head is getting pretty cluttered (Cluttered, cluttered)\nI try, but can't clean up this mess I made\n'Fore I start to think about the future\nFirst, can I please get through a day?\n[Chorus]\nWithout any complications (Ooh, ooh, ooh, ooh)\nDoes it always gotta, does it always gotta\nGotta be so complicated? (Ooh, ooh, ooh, ooh)\nWell, I'm way too young to be gettin' old"}
{"artist": "Mac Miller", "album": "Circles","album_recorded_year": 2018,"album_release_year": 2020,"track_title": "Blue World", "genius_url": "https://genius.com/Mac-miller-blue-world-lyrics", "lyrics": "110 Contributors\nTranslations\nSvenska\nEspañol\nРусский (Russian)\nItaliano\nFrançais\nBlue World Lyrics\n“Blue World” has Mac rapping about the trials and tribulations of life, and reflecting on all that has. On it he makes a subtle reference to his former girlfriend Ariana Grande, and the late Biggie Smalls. It… \nRead More\n \n[Intro: The Four Freshman]\nIt's a blue world without you\nIt's a blue world alone\n[Chorus]\nYeah, well, this a mad world, it made me crazy\nMight just turn around, do one-eighty\nI ain't politickin', I ain't kissin' no babies\nThe devil on my doorstep bein' so shady\nMm, don't trip\nWe don't gotta let him in, don't trip\nYeah, yeah\nI let it go, but I never go with it, mm\n[Verse 1]\nYeah, okay, cool as fall weather, fuck the bullshit\nI'm here to make it all better with a little music for you\nI don't do enough for you\nWithout you, it's the color blue\nOoh, don't trip\nI was in the city, they was talkin' that shit\nHad the homies with me, all the sudden, they split\nWe ain't even worried, we just laughin', that's rich\nYou know how it goes, \nit ain't broke, don't fix\n[Refrain]\nHey, one of these days, we'll all get by\nDon't be afraid, don't fall"}
{"artist": "Mac Miller", "album": "Circles","album_recorded_year": 2018,"album_release_year": 2020, "track_title": "Good News", "genius_url": "https://genius.com/Mac-miller-good-news-lyrics", "lyrics": "241 Contributors\nTranslations\nTürkçe\nSvenska\nEspañol\nРусский (Russian)\nPortuguês\nPolski\nItaliano\nDeutsch\nFrançais\nGood News Lyrics\n“Good News” is the lead single from Miller’s first posthumous project and sixth studio album, Circles. Miller speaks on feeling no reprieve from negative feelings in life, while the people around him only… \nRead More\n \n[Verse 1]\nI spent the whole day in my head\nDo a little spring cleanin'\nI'm always too busy dreamin'\nWell, maybe I should wake up instead\nA lot of things I regret, but I just say I forget\nWhy can't it just be easy?\nWhy does everybody need me to stay?\nOh, I hate the feelin'\nWhen you're high, but you're underneath the ceilin'\nGot the cards in my hand, I hate dealin', yeah\nGet everything I need, then I'm gone, but it ain't stealin'\nCan I get a break?\nI wish that I could just get out my goddamn way\nWhat is there to say?\nThere ain't a better time than today\nWell, maybe I'll lay down for a little, yeah\nInstead of always tryin' to figure everything out\nAnd all I do is say sorry\nHalf the time I don't even know what I'm sayin' it about\n[Chorus]\nGood news, good news, good news\nThat's all they wanna hear\nNo, they don't like it when I'm down\nBut when I'm flyin', oh\nIt make 'em so uncomfortable\nSo different, what's the difference?"}
{"artist": "Mac Miller", "album": "Circles","album_recorded_year": 2018,"album_release_year": 2020, "track_title": "I Can See", "genius_url": "https://genius.com/Mac-miller-i-can-see-lyrics", "lyrics": "84 Contributors\nTranslations\nTürkçe\nSvenska\nEspañol\nРусский (Russian)\nI Can See Lyrics\n[Verse 1]\nI'm so close, I can taste it\nThe man on the moon keep playin'\nPractical jokes, plantin' the mirrors and smoke that I fade away in\nYou be complainin', and I can't explain it, I guess\nNothin' compare to the feelin', the feelin' amazin'\nNow I'm switchin' location\n'Cause heaven too far when you live in the basement\nI'm lookin' for balance, I'm in an oasis\nWell, I need somebody to save me, hmm\nBefore I drive myself crazy\n[Chorus]\nAnd all I know\nIf life is but a dream, then so are we\nShow me somethin', show me somethin', show me somethin'\nAnd all I know\nIf life is but a dream, then so are we\nShow me somethin', show me somethin', somethin' I can see\n[Verse 2]\nYeah, don't tell me to stop\nLet me keep goin' until I cannot\nLife is a fantasy until you wake up in shock\nHittin' the ground, I'm hittin' the ground, I fell from the top\nYou never expect to drop, so hold on, but\nThat's just the way it goes, your god don't wait for no one\nAnd when that's all you know, it keep you on your toes\nYou got so far to go, but look at where you came from"}
{"artist": "Mac Miller", "album": "Circles","album_recorded_year": 2018,"album_release_year": 2020, "track_title": "Everybody", "genius_url": "https://genius.com/Mac-miller-everybody-lyrics", "lyrics": "70 Contributors\nTranslations\nSvenska\nEspañol\nРусский (Russian)\nItaliano\nEverybody Lyrics\n“Everybody” is an inspired cover of Arthur Lee’s 1972 single “Everybody’s Gotta Live”. The instrumental begins with minimal piano keys, with drums, bass, and layered vocals building the instrumental further… \nRead More\n \n[Intro]\nEverybody's gotta live\nAnd everybody's gonna die\nEverybody just wanna have a good, good time\nI think you know the reason why\nOh, oh, oh, oh\nOh, oh, oh, oh\n[Verse 1]\nEverybody's gotta live\nAnd everybody's gonna die\nEverybody's gotta live\nI think you know the reason why\nYeah, sometimes the going gets so good, yeah\nBut then again it get pretty rough, yeah\nBut when I have you in my arms, baby\nYou know I just can't, I just can't get enough\n[Chorus]\nEverybody's gotta live\nAnd everybody's gonna die\nEverybody’s gonna try to have a good, good time\nI think you know the reason why\n[Verse 2]\nSaw a blind man standin' on the corner, baby, yeah\nAnd he couldn't hardly tie his shoes, yeah\nHarmonica and guitar strapped around his neck\nBut he sure could, he sure could play the blues"}
{"artist": "Mac Miller", "album": "Circles","album_recorded_year": 2018,"album_release_year": 2020, "track_title": "Woods", "genius_url": "https://genius.com/Mac-miller-woods-lyrics", "lyrics": "90 Contributors\nTranslations\nFrançais\nSvenska\nEspañol\nItaliano\nWoods Lyrics\nOn “Woods,” Mac Miller details a broken relationship that is beyond fixing. The phrase “out of the woods” implies that the worst of something is over, and that the best is yet to come. In this context, the… \nRead More\n \n[Intro]\nYeah, yeah, yeah, yeah, yeah, yeah\n[Verse 1]\nYeah, things like this ain't built to last\nI might just fade like those before me\nWhen will you forget my past?\nGot questions? Ask, you know the stories\nAnd you need to let me know\nWhen you leave and where you go\nCan I come?\nDo you believe me? Are you close? Yeah\nEven if you don't, that'll get you sprung\n[Chorus]\nDo I, do I, do I love?\nCan I, can I, can I get enough?\n[Verse 2]\nYeah, don't run away, love\nHate love, heartbreak will have you bankrupt\nToo many days in a daze, better wake up\nI put your face in a place where the space was\nNobody makes you feel like you but (Do I?)\nAnd you don't know what you should do\nYou just lookin' for someone to make you move\nOoh, tell me (Do I?)"}
{"artist": "Mac Miller", "album": "Circles","album_recorded_year": 2018,"album_release_year": 2020, "track_title": "Hand Me Downs", "genius_url": "https://genius.com/Mac-miller-hand-me-downs-lyrics", "lyrics": "115 Contributors\nTranslations\nSvenska\nEspañol\nРусский (Russian)\nFrançais\nHand Me Downs Lyrics\n“Hand Me Downs” is the only track on Circles to have a feature with Baro on the chorus. The song features Mac reflecting on his head space, and the methods he uses to cope. The instrumental features a… \nRead More\n \n[Verse 1: Mac Miller]\nI'm thinkin' maybe I should thank you\nOh, baby, I should buy you another round\n'Cause you care, and I swear that I'm here, but I'm there\nIt's gettin' harder to hunt me down\nGet away to a place with a lake, such a great view\nLeave the bank, couple hunnid thou'\nI made it, but I hate once I build it, I break it\nThat might just break me down\n[Pre-Chorus: Mac Miller]\nAnd all I ever needed was somebody with some reason who can keep me sane\nEver since I can remember, I've been keepin' it together, but I'm feelin' strange\nGet away when it ain't really safe and it don't seem right\nBut what's new? You get used to the bullshit, the screws, they go missin'\nIt's likely they might be, but...\n[Chorus: Baro Sura]\nYou remind me\nShit, I need to stay in line\nYou damn well are a great design\nYou, despite bein' an only child\nSay you need more of a family 'round\nLet's turn these genes into hand me downs\n[Post-Chorus: Baro Sura]\nDown, down\nDown, down, down\nDown, down\nDown, down, down"}
{"artist": "Mac Miller", "album": "Circles","album_recorded_year": 2018,"album_release_year": 2020, "track_title": "That's On Me", "genius_url": "https://genius.com/Mac-miller-thats-on-me-lyrics", "lyrics": "57 Contributors\nTranslations\nSvenska\nEspañol\nРусский (Russian)\nThat’s on Me Lyrics\n“That’s on Me” is Mac’s way of expressing accountability for his mental state while also trying to help those who may be in a similar situation. An introspective track filled with allusions to his bad mental… \nRead More\n \n[Chorus]\nThat's on me, that's on me, I know\nThat's on me, that's on me, it's all my fault\nThat's on me, that's on me, I know\nThat's on me, that's on me, I know\n[Verse 1]\nTime moving slowly, I'm bouncing my head off the wall\nI know nobody that knows where we're going at all\nDon't, don't, don't, don't let me down\nAnd I'll pick you up, I'll help you get around\n[Chorus]\nThat's on me, that's on me, I know\nThat's on me, that's on me, it's all my fault\nThat's on me, that's on me, I know\nThat's on me, that's on me, I know\n[Bridge]\nI'll let it go\nI'll cut the strings\nToday I'm flying\n[Verse 2]\nI don't know where I've been lately, but I've been alright\nI said good morning this morning and I'll say good night\nDon't, don't, don't, don't wait around\nWe'll take the stairs that gets us here to there\nIt's unfair when I'm being too proud, but"}
{"artist": "Mac Miller", "album": "Circles","album_recorded_year": 2018,"album_release_year": 2020, "track_title": "Hands", "genius_url": "https://genius.com/Mac-miller-hands-lyrics", "lyrics": "56 Contributors\nTranslations\nSvenska\nEspañol\nРусский (Russian)\nHands Lyrics\n“Hands” is the only traditional rap track on Circles, and features Mac questioning his behavior, and ruminating on some of his more negative thoughts. It features playful keys with a pitched vocal snippet… \nRead More\n \n[Intro]\nYeah, yeah, yeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah, yeah, yeah\n[Chorus]\nYeah, why don't you wake up from your bad dreams?\nWhen's the last time you took a little time for yourself?\nThere's no reason to be so down\nRather fly around like there's no ground\nAnd I, I bet you wish you had these\n'Cause carrying this weight'll break your glass knees\nYeah, don't need no chauffeur, fuck the backseat\nNo, I stay behind the wheel and never half-speed\n[Verse]\nGet the fuck out of my car, this ain't a taxi\nThey love to see me lonely, hate to see me happy\nCall me what you want, she call me \"daddy\"\nGot a knack for gettin' nasty, every day we keepin' tally, yeah\nOoh, it's true I want it badly\nHit the zoom, I be movin' like a athlete\n(Now concentrate) No reason to be that upset\nI'm busy trippin' 'bout some shit that still ain't even happen yet\nI keep it honest as honesty gets\nDon't know why I'm always talkin' if I'm not makin' sense\nI've spent my life livin' with a lot of regrets\nYou throw me off my high horse, I'd probably fall to my death\n(Bad behavior) It's obvious you're not on your best\nI might just pull your card if it's on top of the deck\nGive me, give me what I need and then I'm onto the next\nThat's what we callin' cause and effect"}
{"artist": "Mac Miller", "album": "Circles","album_recorded_year": 2018,"album_release_year": 2020, "track_title": "Surf", "genius_url": "https://genius.com/Mac-miller-surf-lyrics", "lyrics": "73 Contributors\nTranslations\nFrançais\nTürkçe\nSvenska\nEspañol\nРусский (Russian)\nItaliano\nSurf Lyrics\n“Surf” is an emotional overview of Mac Miller’s personal problems and his mental state. Taking a birds-eye view of the situation, Mac allows the audience a view on his perceived “craziness” and his own… \nRead More\n \n[Intro]\nYeah, yeah\nHey, hey, hey\nHey, hey, hey\nHey, hey, hey\nHey, hey\nSaid\n[Verse 1]\nWhere are you goin'? Can I come too?\nThe whole world is open, a playground for me and you\nAnd we could be fine, shit, who the hell knows?\nIt's your eyes and your ears and your mouth and your nose\nHead and your shoulders, your knees and your toes\nI dream of this moment\nWill it come true?\nThe whole world, they know it\nThey just waitin' for me and you\nAnd she, just like I\nGot her head in the clouds\nDon't need to be lower\nBefore it's all over, I promise we'll figure it out\nI ain't comin' down\nWhy would I need to?\nSo much of this world is above us, baby\nThey might tell you that I went crazy\nI'm just tryna read you\nOoh, ooh, oohh\nOoh-ooh-oohh"}
{"artist": "Mac Miller", "album": "Circles","album_recorded_year": 2018,"album_release_year": 2020, "track_title": "Once A Day", "genius_url": "https://genius.com/Mac-miller-once-a-day-lyrics", "lyrics": "75 Contributors\nTranslations\nFrançais\nРусский (Russian)\nSvenska\nEspañol\nOnce a Day Lyrics\nAfter Mac’s death, cell phone footage of him performing “Once a Day” on piano was shown at his Celebration of Life tribute concert in October 2018. The studio version of the song leaked online in October 2019… \nRead More\n \n[Verse 1]\nOnce a day, I rise\nOnce a day, I fall asleep with you\nOnce a day, I try but I can't find a single word\nI wonder what they know\nI wonder if they ever even cared at all\nI wonder, do they see their own reflection in the rain\nAnd look away?\n[Chorus]\nEverybody keep rushin'\nWhy aren't we taking our time?\nEvery now and again, baby, I get high\n[Verse 2]\nDon't ask me what I think\nIt never really mattered what I had to say\nI just keep waiting for another open door\nTo come up soon\nDon't keep it all in your head\nThe only place that you know nobody ever can see\nYou're running low on regret\nNo tears, that's keeping you wet\nI think you gettin' it now\n[Chorus]\nBut everybody keep rushin'\nWhy aren't we taking our time?\nEvery now and again, baby, I get high"}
