{"artist": "Mac Miller", "album": "Swimming","album_recorded_year": 2016,"album_release_year": 2018, "track_title": "Come Back to Earth", "genius_url": "https://genius.com/Mac-miller-come-back-to-earth-lyrics", "lyrics": "124 Contributors\nTranslations\nEspañol\nItaliano\nPortuguês\nFrançais\nCome Back to Earth Lyrics\nOn “Come Back To Earth” Mac provides a cathartic, gentle foundation to begin Swimming. The album’s recurring motifs of self care, self acceptance and personal liberation are introduced through the swimming… \nRead More\n \n[Chorus]\nMy regrets look just like texts I shouldn't send\nAnd I got neighbors, they're more like strangers\nWe could be friends\nI just need a way out\nOf my head\nI'll do anything for a way out\nOf my head\n[Verse]\nIn my own way, this feel like livin'\nSome alternate reality\nAnd I was drownin', but now I'm swimmin'\nThrough stressful waters to relief\nYeah, oh, the things I'd do\nTo spend a little time in Hell\nAnd what I won't tell you\nI'll prolly never even tell myself\nDon't you know that sunshine don't feel right\nWhen you inside all day?\nI wish it was nice out, but it look like rain\nGrey skies are driftin', not livin' forever\nThey told me it only gets better\n[Chorus]\nMy regrets look just like texts I shouldn't send\nAnd I got neighbors, they're more like strangers\nWe could be friends\nI just need a way out\nOf my head\nI'll do anything for a way out\nOf my head"}
{"artist": "Mac Miller", "album": "Swimming","album_recorded_year": 2016,"album_release_year": 2018, "track_title": "Hurt Feelings", "genius_url": "https://genius.com/Mac-miller-hurt-feelings-lyrics", "lyrics": "180 Contributors\nTranslations\nItaliano\nEspañol\nFrançais\nPortuguês\nHurt Feelings Lyrics\nIn this J. Cole-produced track, Mac talks about not changing himself to better his career. It is also his way of telling anyone who has ever doubted him in his career that he made it.\n[Intro]\nYeah\nWoah-woah-woah-woah-woah-woah-woah-woah (Yeah-yeah, yeah-yeah)\nYeah-yeah\nWoah-woah-woah-woah-woah-woah-woah-woah (Yeah-yeah)\nYeah-yeah-yeah-yeah\nWoah-woah-woah-woah-woah-woah-woah-woah (Yeah-yeah-yeah-yeah-yeah-yeah)\nWell, okay\n[Chorus]\nI'm always sayin' I won't change but\nI ain't the same (Same)\nEverything is different, I can't complain\nYou don't know what you missin', shame on you\n(Yeah, yeah, yeah) Shame on you (Yeah)\nEverything is strange (Strange), that's just a game (Game)\nEverybody trippin' (Woo), throwin' it away (Yeah)\nWe was gettin' lifted, now we gettin' paid\nShame on you (Yeah)\n[Verse 1]\n(I-I) Yeah (I)\nI paid the cost to see apostrophes, that means it's mine (Yeah)\nKeep to myself, takin' my time (Uh-huh)\nAlways into some bullshit, and outta line\nDrivin' with my eyes closed, missin' all the signs\nTurn the ignition, I'm driven and sittin' pretty (Pretty)\nListenin' to Whitney and whippin' it through the city, yeah (Yeah, yeah)\nMan on a mission, figure it out\nPuttin' way too much on my shoulders, please hold me down (Down, down)\nI keep my head above the water (Water)\nMy eyes gettin' bigger, so the world is gettin' smaller (Smaller)\nI be gettin' richer but that only made me crazy\nMama told me I was different even when I was a baby\nThat Mercedes through the P.A. when I pull up (Pull up)\nSoundin' like a concert, or a (Or a)\nOr a monster truck\n, \nI'm trippin' but I'm fallin' up\nAlways said I want it all, but it's not enough\nWell, o-kay (Yeah)"}
{"artist": "Mac Miller", "album": "Swimming","album_recorded_year": 2016,"album_release_year": 2018, "track_title": "What's the Use?", "genius_url": "https://genius.com/Mac-miller-whats-the-use-lyrics", "lyrics": "126 Contributors\nTranslations\nEspañol\nFrançais\nPortuguês\nWhat’s the Use? Lyrics\n“What’s the Use?” was teased as the follow up to the album’s first single “Self Care” with guest appearances by Thundercat, Snoop Dogg, and Syd. It premiered a week later via Apple Music on Zane Lowe’s World… \nRead More\n \n[Intro: Mac Miller]\nYeah\n[Chorus: Mac Miller]\nYou can love it, you can leave it\nThey say you're nothin' without it\nDon't let them keep you down\nWhat if I don't need it?\nThere's somethin' about it\nThat just freaks me out\nI just want another minute wit' it, fuck a little\nWhat's the use?\nNever superficial, you gon' know it when it hit you\nGet a little sentimental when I'm off the juice\n[Verse 1: Mac Miller]\nYeah\nOkay, we're colder than the breeze\nBut the breeze ain't flowin' like me, motherfucker, hol' up\nYou don't need to hol' up, yeah\nAnd I can show you how I seem\nWhat it is, what it truly might be, nothin' that you know of\nYou don't need to hol' up\nI'm so a-bove and beyond\nYou take drugs to make it up\n \nway up where we on\nSpace shuttle, Elon\nTime, we don't waste much, fuck when we wake up\nThen I have her sing just like Céline Dion\nCatch me if you can but, you'll never catch me, damn\nWhole lotta, \"Yes, I am\"\nAll the way in wit' no exit plan\nAlready left and the jet don't land\nYeah, the time is tickin', come take a ride, get inside\nThis is highly different, I'm talkin' fly, got a pilot wit' 'im, uh\nCan I mind my business?\nWhy you trippin'? Give you somethin' that your eyes can witness\nOoh, you're too close\nI don't understand why you doin' the most"}
{"artist": "Mac Miller", "album": "Swimming","album_recorded_year": 2016,"album_release_year": 2018, "track_title": "Perfecto", "genius_url": "https://genius.com/Mac-miller-perfecto-lyrics", "lyrics": "117 Contributors\nTranslations\nEspañol\nPortuguês\nPerfecto Lyrics\nMac Miller delves into his perspective on relationships, commenting on both his relationship with drugs and Ariana Grande. Mac discusses his sub-perfect relationships while highlighting their worth and his… \nRead More\n \n[Intro]\nYeah, yeah, yeah, yeah, yeah\nYeah, yeah\nYeah, yeah, yeah, yeah\n[Chorus]\nWell, it ain't perfect but I don't mind\nBecause it's worth it\nWho really has the time at all?\nIt ain't perfect but I don't mind\n'Cause on the surface I look so fine\nBut really I'm buggin', buggin'\nMakin' somethin' outta nothin'\n[Verse 1]\nYeah, as hard as it gets: cool, calm and collected\nHoldin' my breath, this ain't what I expected\nDon't argue to death, pull my heart out my chest\nThe cards is all on the table, I'm callin' it\nDon't say it, I swallow it\nWhen livin' off of borrowed time\nOften I'm on the fence, on a line\nAddin' up what's on my mind\nMy feet on the clouds, head on the ground\nThat weed goin' down, bet you know me now"}
{"artist": "Mac Miller", "album": "Swimming","album_recorded_year": 2016,"album_release_year": 2018, "track_title": "Self Care", "genius_url": "https://genius.com/Mac-miller-self-care-lyrics", "lyrics": "293 Contributors\nTranslations\nEspañol\nPortuguês\nPolski\nFrançais\nTürkçe\nSelf Care Lyrics\n“Self Care” is Mac spreading a message about overcoming hardships, self control, and being aware of how to handle yourself.\n\nWhen tweeting about their relationship, Ariana states that Mac’s “inability to keep… \nRead More\n \n[Part I: Self Care]\n[Intro: Mac Miller & \nJID\n]\n(\nCheck, check, check, check, check, check\n) Mhm, mhm\n(\nOkay\n) Mhm (\nIt don't work, it don't work\n)\n(\nIt don't work, it don't work\n)\nYeah, yeah, yeah, yeah (\nIt \ndon't work, it don't work\n)\nYeah, yeah, yeah (\nIt don't work, it don't work, dollars\n)\n[Chorus: Mac Miller]\nI switched the time zone, but what do I know?\nSpendin' nights hitchhikin', where will I go?\nI could fly home, with my eyes closed\nBut it'd get kinda hard to see, that's no surprise though\nAnd you could find me, I ain't hidin'\nI don't move my feet when I be glidin'\nI just slide in and then I roll out\n[Verse 1: Mac Miller & \nJID\n]\nYep, well, climbin' over that wall (Climbin' over that wall; \nYeah, wall, wall\n)\nMm, I remember, yes, I remember, yes, I remember it all\nSwear the height be too tall (\nYeah\n), so like September I fall\n(Down, down, down) Down below\nNow I know that the medicine be on call, yeah (\nGimme, gimme, gimme\n)\nWhen it's feelin' like you hot enough to melt, yeah\nCan't trust no one, can't even trust yourself, yeah\nAnd I love you, I don't love nobody else, yeah (Ooh-woah)"}
{"artist": "Mac Miller", "album": "Swimming","album_recorded_year": 2016,"album_release_year": 2018, "track_title": "Wings", "genius_url": "https://genius.com/Mac-miller-wings-lyrics", "lyrics": "125 Contributors\nTranslations\nEspañol\nFrançais\nPortuguês\nWings Lyrics\n“Wings” sees Mac Miller finally admitting that his emotional wounds have almost completely healed, that he has moved on from the darkest parts of his life and that the future will only be better for him.\n[Intro]\nYeah, well\n[Verse 1]\nI got a bone to pick like roses (Roses)\nI ain't feelin' broken no more\nBalled a fist, they gossipin', I notice\nTalkin' shit, I wander through the motives\nWonder who the fuck we're supposed to be\nI ain't worried now 'til I leave\nI'm just tryna ride and feel the breeze\nWith somethin' bad beside n' next to me\nWind in my face, don't stop now when it feels so great\nYou can run 'til you slip on the sidewalk\nAnd the same bone that you picked gon' break, that's a motif\n(That's a motif)\n Yeah\nWhen it's comin' right back, so familiar, never been realer\nNever felt so damn good where I'm at\nI don't know what it's all about\nRunnin' through too many thoughts to count (That's way better)\nStill ain't addin' up, I'll let you know when I've had enough, yeah\nYeah, well\n[Pre-Chorus]\nI'd put some money on forever, but I (Hey)\nDon't like to gamble on the weather\n, so I\nJust watch while\nThe sun is shinin', I can look at the horizon\nThe walls keep gettin' wider, I just hope I never find 'em, I know\nHey, well"}
{"artist": "Mac Miller", "album": "Swimming","album_recorded_year": 2016,"album_release_year": 2018, "track_title": "Ladders", "genius_url": "https://genius.com/Mac-miller-ladders-lyrics", "lyrics": "84 Contributors\nTranslations\nItaliano\nEspañol\nPortuguês\nLadders Lyrics\nMac uses Ladders as metaphors for Life. There is an increasingly beautiful view the higher you climb. But along with the climb comes the fear of heights. Not to mention the higher you climb the higher the… \nRead More\n \n[Chorus]\nSomehow we gotta find a way\nNo matter how many miles it take\nI know it feels so good right now\nBut it all come fallin' down\nWhen the night, meet the light, turn to day\nCan't stop, then you won't stop\nI know just how that feel\nWhen you're on top, 'til the ball drop\nYou've never seen it be so real\nIt feels so good right now\nBut it all come fallin' down\nWhen the night, meet the light, turn to day\n[Verse 1]\nFeel it a little, feel it a lot\nI'm swimmin' a bit, but deeper in thought\nKeepin' my head on top of my shoulders\nInto some shit, I'm out of the box\nThis the level I'm on, needin' it all right now or forever is gone\nBaby, the weather is strong, whether it's hot or cold\nI'm comin', knockin' on yo' door\nWell, I'ma, I'ma maintain how I'm stayin' so high\nPut the ladder all the way up 'til we touchin' the sky\nAnd you know you're dead wrong, you're in love with a lie\nAll I, all I, all I wanna do is free yo' mind\nWe don't see no lines, we don't color inside\nIt's a very small world\n, we don't fuck with the size, yeah\nSee the bigger picture when it's beneficial\nLovin' how I fit you, \nblow the whistle when you run out of time\n, yeah\nWakin' up, I open up my eyes\nDo you mind if I blow yo' mind?\nA little closer, baby, don't be shy\nWhy you worried that it's gon' be fine?\nI guess it's that kinda day\nIt's really all I'm tryna say\nWe don't have a lot of time to waste\nSomehow we gotta find a way"}
{"artist": "Mac Miller", "album": "Swimming","album_recorded_year": 2016,"album_release_year": 2018, "track_title": "Small Worlds", "genius_url": "https://genius.com/Mac-miller-small-worlds-lyrics", "lyrics": "123 Contributors\nTranslations\nEspañol\nPortuguês\nFrançais\nSmall Worlds Lyrics\n“Small Worlds” was released on May 30th, 2018 along with “Buttons” and “Programs,” breaking his silence in the wake of his very public rupture with Ariana Grande and subsequently DUI crash and marking his… \nRead More\n \n[Intro]\nYeah, yeah\n[Chorus]\nThe world is so small 'til it ain't, yeah\nI'm buildin' up a wall 'til it break\nShe hate it when I call and it's late\nI don't wanna keep you waitin'\nI hope I never keep you waitin', yeah\n[Verse 1]\nI think I know it all but I don't\nWhy you always at the mall when you're broke? Yeah\nAnd I just wanna ball\nMaybe dunk, but I never been tall, yeah\nI might trip, I never fall\nGod knows I came close (Don't try this at home)\nI know I probably need to do better\nFuck whoever, keep my shit together\nYou never told me bein' rich was so lonely\nNobody know me, oh well\nHard to complain from this five-star hotel\nI'm always in a rush, I've been thinkin' too much, but\nKeep it on the hush, no one need to know, just us\n[Pre-Chorus]\nThat's really all it takes\nWe don't need nothin' but today (Day), today (Day), today (Day), today (Day)"}
{"artist": "Mac Miller", "album": "Swimming","album_recorded_year": 2016,"album_release_year": 2018, "track_title": "Conversation Pt. 1", "genius_url": "https://genius.com/Mac-miller-conversation-pt-1-lyrics", "lyrics": "76 Contributors\nTranslations\nEspañol\nPortuguês\nFrançais\nConversation, Pt. 1 Lyrics\nOn “Conversation Pt. 1,” Mac finds himself dropping braggadocious knowledge on his fans by reminding everyone he’s on another plane of existence. The Pittsburgh native sounds mature and assured of his success… \nRead More\n \n[Chorus]\nWe ain't on the same shit, no way\nYou ain't from my planet, we don't speak the same language\nThis is an occasion, ain't it?\nI'm feelin' good and they hate it\nShit, I don't recognize these faces, yeah\nWhere you from? Who you came with?\nStarted in the basement\nMade it way above the top, now I'm in a spaceship\nIn a spaceship, shit is spacious\n[Verse 1]\nSwear your life is basic\nAll you do is sit around the house, you gettin' faded\nThat ain't entertainment, yeah\nYou missin' every single shot that you ain't takin'\nHey, kid, you could use a little bit of your imagination\nIt could do you right, improve a life you busy wastin'\nSaid it's your money if you make it\nOtherwise, it's just a conversation\nOkay, why you always hatin'?\nLacin' up my sneakers, I be runnin' out of patience, yeah\nIt ain't your money 'til you make it\nOtherwise, it's just a conversation\n[Chorus]\nWe ain't on the same shit, no way\nYou ain't from my planet, we don't speak the same language\nThis is an occasion, ain't it?\nI'm feelin' good and they hate it\nShit, I don't recognize these faces, yeah\nWhere you from? Who you came with?\nStarted in the basement\nMade it way above the top, now I'm in a spaceship\nIn a spaceship, shit is spacious"}
{"artist": "Mac Miller", "album": "Swimming","album_recorded_year": 2016,"album_release_year": 2018, "track_title": "Dunno", "genius_url": "https://genius.com/Mac-miller-dunno-lyrics", "lyrics": "109 Contributors\nTranslations\nEspañol\nPortuguês\nFrançais\nDunno Lyrics\nIt seems as if Mac has dedicated this entire song to Ariana Grande. He reminisces about times he was care-free whenever she was around and mentions some experiences they had together. He’s very expressive and… \nRead More\n \n[Intro]\nYeah\nHmm-hmm\nHmm-hmm\nYeah\n[Verse 1]\nShe do whatever she like\nAnd that just don't seem right, yeah\nMake people so mad, yeah\nThey want her so bad, hmm\nWell, we was fuckin', almost missed my flight\nI wasn't even trippin', I said, \"It's alright,\" yeah\nGoddamn, we was hit last night\nWouldn't you rather get along?\nWouldn't you rather get along?\nYou was coughin' when you hit my weed\nBut I've never seen you feel that free\nSo cute you wanna be like me\nWouldn't you rather get along?\nWouldn't you rather get along?\n[Chorus]\nUntil, until there is no longer\nLet's get lost inside the cloud\nAnd you, you don't gotta work harder\nI can calm you down"}
{"artist": "Mac Miller", "album": "Swimming","album_recorded_year": 2016,"album_release_year": 2018, "track_title": "Jet Fuel", "genius_url": "https://genius.com/Mac-miller-jet-fuel-lyrics", "lyrics": "159 Contributors\nTranslations\nTürkçe\nPortuguês\nDeutsch\nEspañol\nFrançais\nJet Fuel Lyrics\nMac uses “jet fuel” as a metaphor for the drugs and alcohol he uses to deal with problems. Drugs or alcohol have the effect of getting one high, similar to how a plane uses fuel to take off. Mac is… \nRead More\n \n[Part I: Jet Fuel]\n[Intro: Cutty Ranks]\nStopper, to every DJ, dem haffi talk to me proper\nMi come a dancehall, mi a go kill you with di lingua\nGalang Cutty Ranks 'cause you full up of a stamina\nAnyweh me go, Lord, a roots and culture\nOne man me praise, a di Almighty, Jah Jah\nJah Jah give me strength and him give me di power\nThat's why Cutty Ranking, full up of stamina\nCome a dancehall, mi a go kill you with di...\n[Verse 1]\nYeah, used to wanna be a superhero\nFlyin' round with a cape catchin' bad guys\nNow my head underwater\nBut I ain't in the shower and I ain't gettin' baptized (No)\nTo the good and the bad times (Bad times)\nAll the cuts, broken bones, and the black eyes (Black eyes)\nYoung motherfucker with a mad mind\nMade a couple million off of rap lines\nY'all can't tell me nuttin' no more\nCame from the basement under that floor (Floor)\nYou don't come close, you don't even know I'm the GOAT (Hmm)\nYou don't need to know how it go 'cause I know what you want\nAll I wanna do is the most\nBackflip off the rope, sky hook when I'm in the post\nYeah, my girl too clutch to choke, mm (Hmm)\nAnd I ain't callin' it quits\nYou can build a wall with your bricks\nWhile I keep talkin' that shit, it's like this (This), hmm (It's like this)\nLiquor still in my cup (My cup)\nGet faded when I wake up (Wake up)\n'Cause everything is too much (Too much)\nSo what? (So what?)"}
{"artist": "Mac Miller", "album": "Swimming","album_recorded_year": 2016,"album_release_year": 2018, "track_title": "2009", "genius_url": "https://genius.com/Mac-miller-2009-lyrics", "lyrics": "152 Contributors\nTranslations\nEspañol\nPortuguês\nFrançais\n2009 Lyrics\n“2009” is a reflective journey from the year before Mac’s breakout mixtape, K.I.D.S, was released to the present day. He speaks to the listener about the lessons he’s learned and the wisdom he’s gained… \nRead More\n \n[Intro]\nYeah\nEric\nWell\n[Chorus]\nI don't need to lie no more\nNowadays all I do is shine, take a breath and ease my mind, and\nShe don't cry no more\nShe tell me that I get her high 'cause an angel's s'posed to fly, and\nI ain't askin' \"Why?\" no more\nOh, no, I take it if it's mine, I don't stay inside the lines\nIt ain't 2009 no more\nYeah, I know what's behind that door\n[Verse 1]\nYeah, okay, you gotta jump in to swim\nWell, the light was dim in this life of sin\nNow every day I wake up and breathe\nI don't have it all but that's alright with me\nTake it nice and easy, took a flight to see me\nSend you back home with a light that's beamin'\nThe whole team 'bout to figure it out\nWe ice cold, that's what winter about\nAnd sometimes, sometimes I wish I took a simpler route\nInstead of havin' demons that's as big as my house, mhm\nHave a ball with a dribble and bounce\n'Cause the party ain't over 'til they're kickin' me out, yeah\nIsn't it funny? We can make a lot of money\nBuy a lot of things just to feel a lot of ugly\nI was yea high and muddy\nLookin' for what was lookin' for me"}
{"artist": "Mac Miller", "album": "Swimming","album_recorded_year": 2016,"album_release_year": 2018, "track_title": "So It Goes", "genius_url": "https://genius.com/Mac-miller-so-it-goes-lyrics", "lyrics": "150 Contributors\nTranslations\nFrançais\nEspañol\nPortuguês\nSo It Goes Lyrics\nThe haunting final song on Swimming heavily features the phrase “So It Goes,” a line from Kurt Vonnegut’s novel, Slaughterhouse-Five. Vonnegut uses this phrase every time a death occurs.\n\nThe song is featured… \nRead More\n \n[Intro]\n*Dog barking*\nYeah\nYeah, yeah, um\n(What?) Yeah\n('Sup?) Well\n[Verse 1]\nYou could have the world in the palm of your hands\nYou still might drop it\nAnd everybody wanna reach inside your pockets\nI tell 'em, \"Red light, stop it\"\nShit, that give me more headaches than alcoholics\nThere was nothin' in my wallet, just a lot of dreamin'\nI built a crib on top o' the Promised Land, we'll call it even, hmm\nI bring more flavor than all the seasons\nWinter, spring, summer, fall\nThe grass is always greener 'til I cut it all\nPlease leave me to my studies, I give you no applause\nMy hands been countin' money, and it's hard to be the boss\nBut somebody gotta do it (\nIt gets so exhausting\n)\nOften with the bullshit, and, baby, I been through it\nEnough for the both of us\nSo come over later and we won't let no one close to us\nWe could be posted up\nYeah"}
